app/Http/Controllers/Admin/sample-disbursement-request

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cib="http://com.zenithbank.com/custom/cibupload" xmlns:cib1="http://schemas.datacontract.org/2004/07/CIBUploadService.Models">    
  <soapenv:Header/>    
  <soapenv:Body>       
    <cib:SendRequest>          
      <!--Optional:-->          
      <cib:data>             
        <!--Optional:-->             
        <cib1:BulkDebitReference>?</cib1:BulkDebitReference>             
        <!--Optional:-->             
        <cib1:ClientInfo>                
          <!--Optional:-->                
          <cib1:CompanyCode>CIB001484</cib1:CompanyCode>                
          <!--Optional:-->                
          <cib1:Password>pass*145%83078</cib1:Password>                
          <!--Optional:-->                
          <cib1:UserID>test_user</cib1:UserID> 
        </cib1:ClientInfo>             
        <!--Optional:-->             
        <cib1:MAC></cib1:MAC>             
        <!--Optional:-->             
        <cib1:TransactionRequest>                
          <!--Zero or more repetitions:-->                
          <cib1:Transaction>                   
            <!--Optional:-->                   
            <cib1:Amount>2000</cib1:Amount>                   
            <!--Optional:-->                   
            <cib1:BeneficiaryAccount>1020047624</cib1:BeneficiaryAccount>                   
            <!--Optional:-->                   
            <cib1:BeneficiaryAddress></cib1:BeneficiaryAddress>                   
            <!--Optional:-->                   
            <cib1:BeneficiaryBankCode>057</cib1:BeneficiaryBankCode>                   
            <!--Optional:-->                   
            <cib1:BeneficiaryBankSortCode></cib1:BeneficiaryBankSortCode>                   
            <!--Optional:-->                   
            <cib1:BeneficiaryCategory></cib1:BeneficiaryCategory>                   
            <!--Optional:-->                   
            <cib1:BeneficiaryCode></cib1:BeneficiaryCode>                   
            <!--Optional:-->                   
            <cib1:BeneficiaryEmail></cib1:BeneficiaryEmail>                   
            <!--Optional:-->                   
            <cib1:BeneficiaryMobile></cib1:BeneficiaryMobile>                   
            <!--Optional:-->                   
            <cib1:BeneficiaryName>JOHN UBAH</cib1:BeneficiaryName>                   
            <!--Optional:--> 
            <cib1:BeneficiaryPhone></cib1:BeneficiaryPhone>                   
            <!--Optional:-->                   
            <cib1:ContractDate></cib1:ContractDate>                   
            <!--Optional:-->                   
            <cib1:ContractNo></cib1:ContractNo>                   
            <!--Optional:-->                   
            <cib1:DebitAccount>2020076821</cib1:DebitAccount>                   
            <!--Optional:-->                   
            <cib1:DebitAccountName></cib1:DebitAccountName>                   
            <!--Optional:-->                   
            <cib1:DebitCurrency>NGN</cib1:DebitCurrency>                   
            <!--Optional:-->                   
            <cib1:InvoiceNumber></cib1:InvoiceNumber>                   
            <!--Optional:-->                   
            <cib1:PaymentCurrency></cib1:PaymentCurrency>                   
            <!--Optional:-->                   
            <cib1:PaymentMethod></cib1:PaymentMethod>                   
            <!--Optional:-->                   
            <cib1:PaymentType></cib1:PaymentType>                   
            <!--Optional:-->                   
            <cib1:Payment_Due_Date>17/12/2015</cib1:Payment_Due_Date>                   
            <!--Optional:-->                   
            <cib1:TransactionRef>CIB/TEST/BD/15265</cib1:TransactionRef>                
          </cib1:Transaction>             
        </cib1:TransactionRequest>             
        <!--Optional:-->             
        <cib1:UseSingleDebitMultipleCredit>false</cib1:UseSingleDebitMultipleCredit>          
      </cib:data>
    </cib:SendRequest>    
  </soapenv:Body>
</soapenv:Envelope>
